# from django.db import models
# from django.utils.translation import gettext as _
#
#
# class OtvetNum(models.IntegerChoices):
#     RIGHT1 = 1, _('Используется для вывода различных подписей')
#     WRONG1 = 2, _('Поле, заполняемое текстовой информацией')
#     WRONG11 = 3, _('Активизирует какую-то операцию (вызывает выполнение команды')
#     WRONG2 = 4, _('Изменение программного кода')
#     WRONG22 = 5, _('Открытие и закрытие формы')
#     RIGHT2 = 6, _('Щелчок по кнопке')
#     RIGHT3 = 7, _('Набор файлов различных форматов')
#     WRONG3 = 8, _('Программа на языке Visual Basic')
#     WRONG33 = 9, _('Набор окон рабочей среды')
#     WRONG4 = 10, _('Для отображения свойств выбранного объекта')
#     RIGHT4 = 11, _('Для выбора объектов и размещения их на форме')
#     WRONG44 = 12, _('Для изменения свойств выбранного объекта')
#     RIGHT5 = 13, _('BorderStyle')
#     WRONG5 = 14, _('Caption')
#     WRONG55 = 15, _('Enabled')


